benchmarking/courantNumberStudy/courant_number_1000/system/shippingBox/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 270;

    boundaryField
    {
        shippingBox
        {
            type            zeroGradient;         
        }
		symmetryPlanes
        {
			type            symmetry;
        }
        shippingBox_to_air
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           $internalField;
        }
        shippingBox_to_batteries
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           $internalField;
        }
    }
}

p
{
    internalField   uniform 100000;

    boundaryField
    {
		symmetryPlanes
        {
			type            symmetry;
			
        }
    }
}


// ************************************************************************* //
